iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_6
* Address       : 0X06
* Bit Group Name: AIF2_ADCDAT_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_6_AIF2_ADCDAT_SRC_MASK        (uint16_t)0x0004U
#define   WM8994_PWR_MGMT_6_AIF2_ADCDAT_SRC_POSITION    2
int32_t   wm8994_pwr_mgmt_6_aif2_adcdat_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_6
* Address       : 0X06
* Bit Group Name: AIF3_ADCDAT_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_6_AIF3_ADCDAT_SRC_MASK        (uint16_t)0x0018U
#define   WM8994_PWR_MGMT_6_AIF3_ADCDAT_SRC_POSITION    3
int32_t   wm8994_pwr_mgmt_6_aif3_adcdat_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_6
* Address       : 0X06
* Bit Group Name: AIF3_TRI
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_6_AIF3_TRI_MASK        (uint16_t)0x0020U
#define   WM8994_PWR_MGMT_6_AIF3_TRI_POSITION    5
int32_t   wm8994_pwr_mgmt_6_aif3_tri(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_1
* Address       : 0X15
* Bit Group Name: INPUTS_CLAMP
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER1_INPUTS_CLAMP_MASK        (uint16_t)0x0040U
#define   WM8994_INMIXER1_INPUTS_CLAMP_POSITION    6
int32_t   wm8994_inmixer1_inputs_clamp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_1
* Address       : 0X15
* Bit Group Name: IN1LP_MIXINL_BOOST
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER1_IN1LP_MIXINL_BOOST_MASK        (uint16_t)0x0080U
#define   WM8994_INMIXER1_IN1LP_MIXINL_BOOST_POSITION    7
int32_t   wm8994_inmixer1_in1lp_mixinl_boost(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_1
* Address       : 0X15
* Bit Group Name: IN1RP_MIXINR_BOOST
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER1_IN1RP_MIXINR_BOOST_MASK        (uint16_t)0x0100U
#define   WM8994_INMIXER1_IN1RP_MIXINR_BOOST_POSITION    8
int32_t   wm8994_inmixer1_in1rp_mixinr_boost(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN12_VOL
* Address       : 0X18
* Bit Group Name: IN1L_VOL [4:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN1L_VOL_MASK        (uint16_t)0x001F
#define   WM8994_LLI_IN1L_VOL_POSITION    0
int32_t   wm8994_lli_in1l_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN12_VOL
* Address       : 0X18
* Bit Group Name: IN1L_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN1L_ZC_MASK        (uint16_t)0x0040U
#define   WM8994_LLI_IN1L_ZC_POSITION    6
int32_t   wm8994_lli_in1l_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN12_VOL
* Address       : 0X18
* Bit Group Name: IN1L_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN1L_MUTE_MASK        (uint16_t)0x0080U
#define   WM8994_LLI_IN1L_MUTE_POSITION    7
int32_t   wm8994_lli_in1l_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN12_VOL
* Address       : 0X18
* Bit Group Name: IN1_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN1_VU_MASK        (uint16_t)0x0100U
#define   WM8994_LLI_IN1_VU_POSITION    8
int32_t   wm8994_lli_in1_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN34_VOL
* Address       : 0X19
* Bit Group Name: IN2L_VOL [4:0]
* Permission    : RW
***************************************************************2****************/
#define   WM8994_LLI_IN2L_VOL_MASK        (uint16_t)0x001F
#define   WM8994_LLI_IN2L_VOL_POSITION    0
int32_t   wm8994_lli_in2l_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN34_VOL
* Address       : 0X19
* Bit Group Name: IN2L_ZC
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN2L_ZC_MASK        (uint16_t)0x0040U
#define   WM8994_LLI_IN2L_ZC_POSITION    6
int32_t   wm8994_lli_in2l_zc(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_LEFT_LINE_IN34_VOL
* Address       : 0X19
* Bit Group Name: IN2L_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_LLI_IN2L_MUTE_MASK        (uint16_t)0x0080U
#define   WM8994_LLI_IN2L_MUTE_POSITION    7
int32_t   wm8994_lli_in2l_mute(wm8994_ctx_t *ctx, uint16_t value);

