iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN1RP_TO_IN1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN1RP_TO_IN1R_MASK          (uint16_t)0x0002
#define   WM8994_INMIXER2_IN1RP_TO_IN1R_POSITION      1
int32_t   wm8994_inmixer2_in1rp_to_in1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN2RN_TO_IN2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN2RN_TO_IN2R_MASK          (uint16_t)0x0004
#define   WM8994_INMIXER2_IN2RN_TO_IN2R_POSITION      2
int32_t   wm8994_inmixer2_in2rn_to_in2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN2RP_TO_IN2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN2RP_TO_IN2R_MASK          (uint16_t)0x0008
#define   WM8994_INMIXER2_IN2RP_TO_IN2R_POSITION      3
int32_t   wm8994_inmixer2_in2rp_to_in2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN1LN_TO_IN1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN1LN_TO_IN1L_MASK          (uint16_t)0x0010
#define   WM8994_INMIXER2_IN1LN_TO_IN1L_POSITION      4
int32_t   wm8994_inmixer2_in1ln_to_in1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN1LP_TO_IN1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN1LP_TO_IN1L_MASK          (uint16_t)0x0020
#define   WM8994_INMIXER2_IN1LP_TO_IN1L_POSITION      5
int32_t   wm8994_inmixer2_in1lp_to_in1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN2LN_TO_IN2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN2LN_TO_IN2L_MASK          (uint16_t)0x0040
#define   WM8994_INMIXER2_IN2LN_TO_IN2L_POSITION      6
int32_t   wm8994_inmixer2_in2ln_to_in2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_2
* Address       : 0X28
* Bit Group Name: IN2LP_TO_IN2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER2_IN2LP_TO_IN2L_MASK          (uint16_t)0x0080
#define   WM8994_INMIXER2_IN2LP_TO_IN2L_POSITION      7
int32_t   wm8994_inmixer2_in2lp_to_in2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_3
* Address       : 0X29
* Bit Group Name: MIXOUTL_MIXINL_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER3_MIXOUTL_MIXINL_VOL_MASK          (uint16_t)0x0007
#define   WM8994_INMIXER3_MIXOUTL_MIXINL_VOL_POSITION      0
int32_t   wm8994_inmixer3_mixoutl_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_3
* Address       : 0X29
* Bit Group Name: IN1L_MIXINL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER3_IN1L_MIXINL_VOL_MASK          (uint16_t)0x0010
#define   WM8994_INMIXER3_IN1L_MIXINL_VOL_POSITION      4
int32_t   wm8994_inmixer3_in1l_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_3
* Address       : 0X29
* Bit Group Name: IN1L_TO_MIXINL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER3_IN1L_TO_MIXINL_MASK          (uint16_t)0x0020
#define   WM8994_INMIXER3_IN1L_TO_MIXINL_POSITION      5
int32_t   wm8994_inmixer3_in1l_to_mixinl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_3
* Address       : 0X29
* Bit Group Name: IN2L_MIXINL_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER3_IN2L_MIXINL_VOL_MASK          (uint16_t)0x0080
#define   WM8994_INMIXER3_IN2L_MIXINL_VOL_POSITION      7
int32_t   wm8994_inmixer3_in2l_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_3
* Address       : 0X29
* Bit Group Name: IN2L_TO_MIXINL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER3_IN2L_TO_MIXINL_MASK          (uint16_t)0x0100
#define   WM8994_INMIXER3_IN2L_TO_MIXINL_POSITION      8
int32_t   wm8994_inmixer3_in2l_to_mixinl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_4
* Address       : 0X2A
* Bit Group Name: MIXOUTR_MIXINR_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER4_MIXOUTR_MIXINR_VOL_MASK          (uint16_t)0x0007
#define   WM8994_INMIXER4_MIXOUTR_MIXINR_VOL_POSITION      0
int32_t   wm8994_inmixer4_mixoutr_mixinr_vol(wm8994_ctx_t *ctx, uint16_t value);

