iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_4
* Address       : 0X2A
* Bit Group Name: IN1R_MIXINR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER4_IN1R_MIXINR_VOL_MASK          (uint16_t)0x0010
#define   WM8994_INMIXER4_IN1R_MIXINR_VOL_POSITION      4
int32_t   wm8994_inmixer4_in1r_mixinr_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_4
* Address       : 0X2A
* Bit Group Name: IN1R_TO_MIXINR
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER4_IN1R_TO_MIXINR_MASK          (uint16_t)0x0020
#define   WM8994_INMIXER4_IN1R_TO_MIXINR_POSITION      5
int32_t   wm8994_inmixer4_in1r_to_mixinr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_4
* Address       : 0X2A
* Bit Group Name: IN2R_MIXINR_VOL
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER4_IN2R_MIXINR_VOL_MASK          (uint16_t)0x0080
#define   WM8994_INMIXER4_IN2R_MIXINR_VOL_POSITION      7
int32_t   wm8994_inmixer4_in2r_mixinr_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_4
* Address       : 0X2A
* Bit Group Name: IN2R_TO_MIXINR
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER4_IN2R_TO_MIXINR_MASK          (uint16_t)0x0100
#define   WM8994_INMIXER4_IN2R_TO_MIXINR_POSITION      8
int32_t   wm8994_inmixer4_in2r_to_mixinr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_5
* Address       : 0X2B
* Bit Group Name: IN2LRP_MIXINL_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER5_IN2LRP_MIXINL_VOL_MASK          (uint16_t)0x0007
#define   WM8994_INMIXER5_IN2LRP_MIXINL_VOL_POSITION      0
int32_t   wm8994_inmixer5_in2lrp_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_5
* Address       : 0X2B
* Bit Group Name: IN1LP_MIXINL_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER5_IN1LP_MIXINL_VOL_MASK          (uint16_t)0x01C0
#define   WM8994_INMIXER5_IN1LP_MIXINL_VOL_POSITION      6
int32_t   wm8994_inmixer5_in1lp_mixinl_vol(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_6
* Address       : 0X2C
* Bit Group Name: IN2LRP_MIXINR_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER6_IN2LRP_MIXINR_VOL_MASK          (uint16_t)0x0007
#define   WM8994_INMIXER6_IN2LRP_MIXINR_VOL_POSITION      0
int32_t   wm8994_inmixer6_in2lrp_mixinr_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_INPUT_MIXER_6
* Address       : 0X2C
* Bit Group Name: IN1RP_MIXINR_VOL [2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_INMIXER6_IN1RP_MIXINR_VOL_MASK          (uint16_t)0x01C0
#define   WM8994_INMIXER6_IN1RP_MIXINR_VOL_POSITION      6
int32_t   wm8994_inmixer6_in1rp_mixinr_vol(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_1
* Address       : 0X2D
* Bit Group Name: DAC1L_TO_MIXOUTL
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER1_DAC1L_TO_MIXOUTL_MASK          (uint16_t)0x0001
#define   WM8994_OUTMIXER1_DAC1L_TO_MIXOUTL_POSITION      0
int32_t   wm8994_outmixer1_dac1l_to_mixoutl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_1
* Address       : 0X2D
* Bit Group Name: IN2LP_TO_MIXOUTL
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER1_IN2LP_TO_MIXOUTL_MASK          (uint16_t)0x0002
#define   WM8994_OUTMIXER1_IN2LP_TO_MIXOUTL_POSITION      1
int32_t   wm8994_outmixer1_in2lp_to_mixoutl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_1
* Address       : 0X2D
* Bit Group Name: IN1L_TO_MIXOUTL
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER1_IN1L_TO_MIXOUTL_MASK          (uint16_t)0x0004
#define   WM8994_OUTMIXER1_IN1L_TO_MIXOUTL_POSITION      2
int32_t   wm8994_outmixer1_in1l_to_mixoutl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_1
* Address       : 0X2D
* Bit Group Name: IN1R_TO_MIXOUTL
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER1_IN1R_TO_MIXOUTL_MASK          (uint16_t)0x0008
#define   WM8994_OUTMIXER1_IN1R_TO_MIXOUTL_POSITION      3
int32_t   wm8994_outmixer1_in1r_to_mixoutl(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_OUTPUT_MIXER_1
* Address       : 0X2D
* Bit Group Name: IN2LN_TO_MIXOUTL
* Permission    : RW
*******************************************************************************/
#define   WM8994_OUTMIXER1_IN2LN_TO_MIXOUTL_MASK          (uint16_t)0x0010
#define   WM8994_OUTMIXER1_IN2LN_TO_MIXOUTL_POSITION      4
int32_t   wm8994_outmixer1_in2ln_to_mixoutl(wm8994_ctx_t *ctx, uint16_t value);

