iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/Components/wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LMR
* Address       : 0X606
* Bit Group Name: AIF2DACL_TO_AIF1ADC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1LMR_AIF2DACL_TO_AIF1ADC1L_MASK                 (uint16_t)0x0001
#define   WM8994_ADC1LMR_AIF2DACL_TO_AIF1ADC1L_POSITION             0
int32_t   wm8994_adc1lmr_aif2dacl_to_aif1adc1l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_LMR
* Address       : 0X606
* Bit Group Name: ADC1L_TO_AIF1ADC1L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1LMR_ADC1L_TO_AIF1ADC1L_MASK                 (uint16_t)0x0002
#define   WM8994_ADC1LMR_ADC1L_TO_AIF1ADC1L_POSITION             1
int32_t   wm8994_adc1lmr_adc1l_to_aif1adc1l(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RMR
* Address       : 0X607
* Bit Group Name: AIF2DACL_TO_AIF1ADC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1RMR_AIF2DACL_TO_AIF1ADC1R_MASK                 (uint16_t)0x0001
#define   WM8994_ADC1RMR_AIF2DACL_TO_AIF1ADC1R_POSITION             0
int32_t   wm8994_adc1rmr_aif2dacl_to_aif1adc1r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC1_RMR
* Address       : 0X607
* Bit Group Name: ADC1R_TO_AIF1ADC1R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC1RMR_ADC1R_TO_AIF1ADC1R_MASK                 (uint16_t)0x0002
#define   WM8994_ADC1RMR_ADC1R_TO_AIF1ADC1R_POSITION             1
int32_t   wm8994_adc1rmr_adc1r_to_aif1adc1r(wm8994_ctx_t *ctx, uint16_t value);
         
/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_LMR
* Address       : 0X608
* Bit Group Name: AIF2DACL_TO_AIF1ADC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2LMR_AIF2DACL_TO_AIF1ADC2L_MASK                 (uint16_t)0x0001
#define   WM8994_ADC2LMR_AIF2DACL_TO_AIF1ADC2L_POSITION             0
int32_t   wm8994_adc2lmr_aif2dacl_to_aif1adc2l(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_LMR
* Address       : 0X608
* Bit Group Name: ADC2L_TO_AIF1ADC2L
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2LMR_ADC2L_TO_AIF1ADC2L_MASK                 (uint16_t)0x0002
#define   WM8994_ADC2LMR_ADC2L_TO_AIF1ADC2L_POSITION             1
int32_t   wm8994_adc2lmr_adc2l_to_aif1adc2l(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_RMR
* Address       : 0X609
* Bit Group Name: AIF2DACL_TO_AIF1ADC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2RMR_AIF2DACL_TO_AIF1ADC2R_MASK                 (uint16_t)0x0001
#define   WM8994_ADC2RMR_AIF2DACL_TO_AIF1ADC2R_POSITION             0
int32_t   wm8994_adc2rmr_aif2dacl_to_aif1adc2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_ADC2_RMR
* Address       : 0X609
* Bit Group Name: ADC2R_TO_AIF1ADC2R
* Permission    : RW
*******************************************************************************/
#define   WM8994_ADC2RMR_ADC2R_TO_AIF1ADC2R_MASK                 (uint16_t)0x0002
#define   WM8994_ADC2RMR_ADC2R_TO_AIF1ADC2R_POSITION             1
int32_t   wm8994_adc2rmr_adc2r_to_aif1adc2r(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC1_LEFT_VOL_VSET_POSITION             0
int32_t   wm8994_dac1_left_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_VU
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_VU_MASK                 (uint16_t)0x0100
#define   WM8994_DAC1_LEFT_VOL_VU_POSITION             8
int32_t   wm8994_dac1_left_vol_vu(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_LEFT_VOL
* Address       : 0X610
* Bit Group Name: DAC1L_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_LEFT_VOL_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_DAC1_LEFT_VOL_MUTE_POSITION             9
int32_t   wm8994_dac1_left_vol_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DAC1_RIGHT_VOL
* Address       : 0X611
* Bit Group Name: DAC1R_VOL[7:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_DAC1_RIGHT_VOL_VSET_MASK                 (uint16_t)0x00FF
#define   WM8994_DAC1_RIGHT_VOL_VSET_POSITION             0
int32_t   wm8994_dac1_right_vol_vset(wm8994_ctx_t *ctx, uint16_t value);

